In [1]:
import numpy as np 
import pandas as pd

In [12]:
data1 = {
    "name": ['harry', 'ash', 'divj', 'vams'],
    "marks":[87, 99, 98, 91],
    "city": ['mumbai', 'delhi', 'montreal', 'vizag'],
    "code": ['001', '009', '008', '003']
}

In [13]:
df = pd.DataFrame(data1)
print(df)

    name  marks      city code
0  harry     87    mumbai  001
1    ash     99     delhi  009
2   divj     98  montreal  008
3   vams     91     vizag  003

In [14]:
df.to_csv('friends_data.csv')

In [15]:
df.head(2)

    name  marks    city code
0  harry     87  mumbai  001
1    ash     99   delhi  009

In [16]:
df.tail(2)

   name  marks      city code
2  divj     98  montreal  008
3  vams     91     vizag  003

In [17]:
df.describe()

           marks
count   4.000000
mean   93.750000
std     5.737305
min    87.000000
25%    90.000000
50%    94.500000
75%    98.250000
max    99.000000

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   marks   4 non-null      int64
 2   city    4 non-null      object
 3   code    4 non-null      object
dtypes: int64(1), object(3)
memory usage: 260.0+ bytes

In [19]:
df.shape

(4, 4)

In [20]:
df.dtypes

name     object
marks     int64
city     object
code     object
dtype: object

In [22]:
df['marks'][0]=50

C:\Users\katari.asish\AppData\Local\Temp\ipykernel_19948\1757823268.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['marks'][0]=50

In [23]:
df

    name  marks      city code
0  harry     50    mumbai  001
1    ash     99     delhi  009
2   divj     98  montreal  008
3   vams     91     vizag  003

In [24]:
df['name']

0    harry
1      ash
2     divj
3     vams
Name: name, dtype: object